app/Http/Controllers/CustomerController.php

select * from `customers` order by `id` desc
---
    public function index()
    {
        $customers=Customer::orderBy('id', 'desc')->get();