app/Http/Controllers/InvoiceController.php

    public function index()
    {
        $invoices=Invoice::orderBy('id','desc')->get();
---
select * from `invoices` order by `id` desc

    public function export()
    {
        $items=Invoice::orderBy('id','desc')->get();
---
select * from `invoices` order by `id` desc