app/Http/Controllers/ItemController.php

select * from `items` order by `id` desc
---
    public function index()
    {
        /*$items=Item::orderBy('id','desc')->get();
        $excel = Exporter::make('Excel');
        $excel->load($items);
        return $excel->stream('users.csv');*/

        $items=Item::orderBy('id','desc')->get();

delete from `items` where `id` = 18
---
    public function destroy(Item $item)
    {
        unlink('files/'.$item->photo);
        $item->delete();