app/Http/Controllers/PurchaseController.php

    public function index()
    {
        $purchases=Purchase::orderBy('id','desc')->get();
---
select * from `purchases` order by `id` desc

    public function getPrice(Request $request)
    {
        $item= Item::find($request->id);

        $data= $item->price;

        $data['price']=$data->purchase_prices;
        $data['name']=Item::where('id',$request->id)->first()->name;
---
select * from `items` where `id` = '2' limit 1
select * from `prices` where `prices`.`item_id` = 2 and `prices`.`item_id` is not null limit 1

    public function export()
    {
        $items=Purchase::orderBy('id','desc')->get();
---
select * from `purchases` order by `id` desc