app/Http/Controllers/RoleController.php

    public function index() {
        $roles = Role::all();//Get all roles
---
select * from `roles`