app/Http/Controllers/UnitController.php

    public function index()
    {
        $units=Unit::orderBy('id', 'desc')->get();
---
select * from `units` order by `id` desc