app/Http/Controllers/UserController.php

    public function index()
    {
        $users = User::all();
---
select * from `users`